Repository: mehdirahbe/matesla
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fr

source: Sign up
fr: Créer un compte

source: Battery degradation graphs
fr: Graphes de dégradation de la batterie

source: Firmware version
fr: Version firmware

source: Most recent Firmware updates
fr: Mises à jour du firmware les plus récentes

source: Download Firmware Stats
fr: Télécharger les stats du Firmware

source: Cars statistics
fr: Statistiques des voitures

source: Car addition Date
fr: Date d'addition de la voiture

source: Car type
fr: Type de voiture

source: Charge port
fr: Port de charge

source: Exterior color
fr: Couleur extérieure

source: Has air suspension
fr: Suspension à air

source: Has ludicrous mode
fr: Mode ludicrous

source: Is charge port motorized
fr: Port de charge motorisé

source: Has rear seat heaters
fr: Sièges arrières chauffants

source: Right hand drive
fr: Conduite à gauche

source: Roof color
fr: Couleur du toît

source: Wheel
fr: Roues

source: Is sentry mode available
fr: Mode sentry disponible

source: Is FSD enabled
fr: Option Conduite autonome (FSD) active

source: European union car
fr: Voiture européenne

source: EPA Range (miles)
fr: Range EPA (miles)

source: Is Dual Motor
fr: Double motorisation

source: Car year
fr: Année de la voiture

source: Outside temperature (°C)
fr: Température extérieure (°C)

source: Odometer (miles)
fr: Odometre (miles)

source: Battery level (%)
fr: Niveau batterie (%)

source: Battery charge limit (%)
fr: Limite de charge de la batterie (%)

source: Estim. number of battery cycles
fr: Nombre de cycles estimé de la batterie

source: No Value
fr: Aucune valeur

source: True
fr: Vrai

source: False
fr: Faux

source: Desired Charge Level
fr: Niveau de charge désiré

source: Driver temperature
fr: Température pour le conducteur (°C)

source: Tesla account user
fr: Utilisateur du compte Tesla

source: Tesla account password
fr: Mot de passe du compte Tesla

source: Tesla token (only advanced users)
fr: Jeton Tesla (utilisateurs avancés)

source: Tesla refresh token (advanced users, optional)
fr: Jeton de rafraîchissement Tesla (utilisateurs avancés, optionel)

source: Tesla token creation time (advanced users, optional)
fr: Moment de création du jeton Tesla (utilisateurs avancés, optionel)

source: logout
fr: Se déconnecter

source: Firmware and cars Stats
fr: Stats du firmware Tesla et des voitures

source: Please either enter (one of the 2 methods):
fr: Veuillez entrer (une des 2 méthodes):

source: a) your tesla credentials: user and password (recommanded method)
fr: a) Vos informations de compte Tesla: utilisateur et mot de passe (méthode recommandée)

source: b) A token (advanced users)
fr: b) Un jeton (token), pour utilisateurs avancés

source: If you submit your user, we will use it to generate a token and your user will NOT be stored.
fr: Si vous soumettez votre utilisateur, nous l'utiliserons pour générer un jeton et votre utilisateur ne SERA PAS stocké

source: The token allow to connect to your Tesla car, it does expire after 45 days.
fr: Le jeton permet de se connecter à votre voiture Tesla, il expire après 45 jours

source: The token alone does not allow to put your car in drive mode.
fr: Le jeton seul ne permet pas de mettre la voiture en mode conduite.

source: Token is invalidated if you change your tesla password.
fr: Le jeton est invalidé quand vous changez votre mot de passe

source: If you did choose to provide a token, optionally, you can also provide token creation date to know when the token will expire.
fr: Si vous avez choisi de fournir un jeton, de manière optionelle, vous pouvez également fournir une date de création du jeton, de manière à savoir quand ce dernier expire.

source: The optional refresh token then allow to get automatically a new one from Tesla.
fr: Le jeton de rafraîchissement permettra d'en obtenir automatiquement un nouveau de la part de Tesla

source: If you only fill the token, we have no way to renew it, and this form will be presented again at expiration.
fr: Si vous remplissez uniquement le jeton, nous n'avons aucun moyen de le renouveler, et ce formulaire vous sera à nouveau présenté à l'expiration

source: Save
fr: Sauver

source: For advanced users: you can run in any python console this code to obtain your token, refresh and creation time.
fr: Pour les utilisateurs avancés: vous pouvez exécuter ce code dans une console Python pour obtenir votre jeton, jeton de renouvellement et date de création.

source: You have to install
fr: Vous devez installer

source: and
fr: et

source: package first.
fr: en premier

source: Tesla account
fr: Compte Tesla

source: Connection error. Please check your internet connection.
fr: Erreur de connection. Veuillez vérifier votre connection internet.

source: Retry?
fr: Réessayer?

source: No vehicles are associated to your account. Please retry when your car will be there.
fr: Aucune voiture n'est associée à votre compte. Veuillez réessayer quand elle sera là.

source: Tesla server did return an error when executing a command
fr: Le serveur Tesla a renvoyé une erreur lors de l'exécution de la commande

source: Tesla server did return an error
fr: Le serveur Tesla a renvoyé une erreur

source: Your tesla is asleep
fr: Votre tesla est endormie

source: You are on local computer, only used to test new developments.
fr: Vous êtes sur l'ordinateur local, utilisé uniquement pour tester de nouveaux développements..

source: Please go on official site instead <a href="https://matesla.herokuapp.com" class="btn btn-danger btn-sm">https://matesla.herokuapp.com</a></h6>
fr: Veuillez aller à la place sur le site officiel <a href="https://matesla.herokuapp.com" class="btn btn-danger btn-sm">https://matesla.herokuapp.com</a></h6>

source: You are on afternoon-scrubland-61531.herokuapp.com, only used to test deployment.
fr: Vous êtes sur afternoon-scrubland-61531.herokuapp.com, utilisé uniquement pour tester le déploiement.

source: Your car
fr: Votre voiture

source: Flash lights
fr: Faire clignoter les phares

source: Honk horn (not night when people sleep)
fr: Faire klaxoner (pas la nuit quand les gens dorment)

source: Start charge
fr: Démarrer la charge

source: Stop charge
fr: Arrêter la charge

source: My data
fr: Mes données

source: Json current data
fr: Données courantes en Json

source: Firmware history
fr: Historique firmware

source: General information
fr: Informations générales

source: State
fr: Etat

source: Is car locked
fr: Verrouillée?

source: Yes, unlock?
fr: Oui, déverrouiller?

source: No, lock?
fr: Non, verrouiller?

source: Active, stop?
fr: Actif, stop?

source: Inactive, start?
fr: Inactif, démarrer?

source: Valet mode
fr: Mode valet

source: Charge status
fr: Status de charge

source: Battery level (%%)
fr: Niveau batterie (%%)

source: Battery range km
fr: Range de la batterie km

source: Battery charge
fr: Batterie en charge

source: Battery degradation (%%)
fr: Dégradation de la batterie (%%)

source: Battery charge limit (%%)
fr: Limite de charge de la batterie (%%)

source: Is Charge port open
fr: Port de charge ouvert

source: Yes, close?
fr: Oui, fermer?

source: No, open?
fr: Non, ouvrir?

source: Voltage in V
fr: Voltage en V

source: Current in A
fr: Courant en A

source: Power in kW
fr: Puissance en kW

source: Number of phases
fr: Nombre de phases

source: Time left in minutes
fr: Temps restant en minutes

source: Drive and location
fr: Conduite et emplacement

source: Speed
fr: Vitesse

source: Location
fr: Addresse

source: Odometer
fr: Odometre

source: Climate information
fr: Climatisation

source: Is climate on
fr: Climatisation

source: Yes, stop?
fr: Oui, arrêter?

source: No, start?
fr: Non, démarrer?

source: Inside temperature
fr: Température intérieure

source: Outside temperature
fr: Température extérieure

source: Driver Temperature setting
fr: Température pour le conducteur

source: English
fr: Anglais

source: Espanol
fr: Espagnol

source: Download my Data
fr: Télécharger mes données

source: Charge related graphs
fr: Graphes liés à la charge

source: Temperature related graphs
fr: Graphes liés à la température

source: Drive related graphs
fr: Graphes liés à la conduite

source: Driver temperature (°C)
fr: Température pour le conducteur (°C)

source: Inside temperature (°C)
fr: Température intérieure (°C)

source: Passenger temperature (°C)
fr: Température du passager (°C)

source: Power
fr: Puissance

source: Battery range (miles)
fr: Range de la batterie (miles)

source: Charge rate
fr: Vitesse de charge

source: Charger actual current (A)
fr: Courant actuel de charge (A)

source: Charger phases
fr: Nombre de phases

source: Charger power (kW)
fr: Puissance de charge (kW)

source: Charger voltage (V)
fr: Voltage de charge (V)

source: Estimated battery range (miles)
fr: Range estimé de la batterie (miles)

source: Usable battery level (%)
fr: Niveau utilisable batterie (%)

source: Battery degradation (%)
fr: Dégradation de la batterie (%)

source: Average
fr: Moyenne

source: Login
fr: Se connecter

source: Signup
fr: Créer un compte

source: MaTesla is a Python/django free open source website using tesla api to connect to your marvellous Tesla car, have information on its state, location and remote control charge, temperature,... Statistics on firmware updates are also available.
fr: MaTesla est un site web Python/django libre utilisant l'API de Tesla pour se connecter à votre merveilleuse voiture Tesla, obtenir des informations sur son état, sa position, et contrôller à distance sa charge, sa température,... Des statistiques sur les mises à jour du firmware sont également disponibles.

source: Have fun and you are the most welcome if you want to contribute :-)
fr: Amusez vous, vous êtes les bienvenus si vous voulez contribuer :-)
